#include <stdio.h>
#include <stdlib.h>
#include <getch.h>
#include <time.h>
int main()
{
	//1、定义地图二维数组
	char map[10][10]={
		{'#','#','#','#','#','#','#','#','#','#'},
		{'#','@',' ','#','#','#',' ',' ',' ','#'},
		{'#','#',' ','#',' ',' ',' ','#',' ','#'},
		{'#','#',' ','#',' ','#','#',' ',' ','#'},
		{'#',' ',' ','#',' ','#','#',' ','#','#'},
		{'#',' ','#','#',' ','#','#',' ',' ','#'},
		{'#',' ','#',' ',' ','#','#','#',' ',' '},
		{'#',' ','#',' ','#',' ',' ',' ','#','#'},
		{'#',' ',' ',' ',' ',' ','#',' ',' ','#'},
		{'#','#','#','#','#','#','#','#','#','#'},
		};
	//2、定义记录角色位置变量
	int x=1,y=1;
	time_t start_time=time(NULL);
	for(;;)
	{
		system("clear");
		for(int i=0;i<10;i++)
		{
			for(int j=0;j<10;j++)
			{
				printf("%c ",map[i][j]);
			}
			puts("");
		}
		if(map[6][9]=='@')
		{
			printf("成功逃离!总用时%lu秒\n",time(NULL)-start_time);
			break;
		}
		int dir=getch();
		if(dir==183 && map[x-1][y]==' ')
		{	
			map[x][y]=' ';
			x=x-1;
			map[x][y]='@';
		}
		if(dir==184 && map[x+1][y]==' ')
		{	
			map[x][y]=' ';
			x=x+1;
			map[x][y]='@';
		}
		if(dir==186 && map[x][y-1]==' ')
		{	
			map[x][y]=' ';
			y=y-1;
			map[x][y]='@';
		}
		if(dir==185 && map[x][y+1]==' ')
		{	
			map[x][y]=' ';
			y=y+1;
			map[x][y]='@';
		}
	}
}
